---
kind: method
id: M:Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.Dispose
source: html/737c2175-ad3e-ca2b-e410-3ec745b55c7f.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.Dispose Method

Releases all resources used by the FabricationNetworkChangeService

## Syntax (C#)
```csharp
public void Dispose()
```